# Config file for layer 5 of the network
# Note: param-stddev in next component defaults to 1/sqrt(input-dim).
component name=affine5 type=NaturalGradientAffineComponent input-dim=512 output-dim=2048 bias-stddev=0
# In nnet3 framework, p in P-norm is always 2.
component name=nonlin5 type=PnormComponent input-dim=2048 output-dim=256
component name=renorm5 type=NormalizeComponent dim=256 target-rms=1.0
component name=final-affine type=NaturalGradientAffineComponent input-dim=256 output-dim=3360 param-stddev=0 bias-stddev=0
component name=final-fixed-scale type=FixedScaleComponent scales=exp/nnet3/tdnn/configs/presoftmax_prior_scale.vec
component name=final-log-softmax type=LogSoftmaxComponent dim=3360
# Now for the network structure
component-node name=affine5 component=affine5 input=Append(Offset(renorm4, -4), Offset(renorm4, 4)) 
component-node name=nonlin5 component=nonlin5 input=affine5
component-node name=renorm5 component=renorm5 input=nonlin5
component-node name=final-affine component=final-affine input=renorm5
component-node name=final-fixed-scale component=final-fixed-scale input=final-affine
component-node name=final-log-softmax component=final-log-softmax input=final-fixed-scale
output-node name=output input=final-log-softmax
