# Config file for layer 6 of the network
# Note: param-stddev in next component defaults to 1/sqrt(input-dim).
component name=affine6 type=NaturalGradientAffineComponent input-dim=256 output-dim=2048 bias-stddev=0
# In nnet3 framework, p in P-norm is always 2.
component name=nonlin6 type=PnormComponent input-dim=2048 output-dim=256
component name=renorm6 type=NormalizeComponent dim=256 target-rms=1.0
component name=final-affine type=NaturalGradientAffineComponent input-dim=256 output-dim=3360 param-stddev=0 bias-stddev=0
component name=final-fixed-scale type=FixedScaleComponent scales=exp/nnet3/tdnn/configs/presoftmax_prior_scale.vec
component name=final-log-softmax type=LogSoftmaxComponent dim=3360
# Now for the network structure
component-node name=affine6 component=affine6 input=Append(renorm5) 
component-node name=nonlin6 component=nonlin6 input=affine6
component-node name=renorm6 component=renorm6 input=nonlin6
component-node name=final-affine component=final-affine input=renorm6
component-node name=final-fixed-scale component=final-fixed-scale input=final-affine
component-node name=final-log-softmax component=final-log-softmax input=final-fixed-scale
output-node name=output input=final-log-softmax
