# Config file for layer 1 of the network
component name=lda type=FixedAffineComponent matrix=exp/nnet3/tdnn/configs/lda.mat
# Note: param-stddev in next component defaults to 1/sqrt(input-dim).
component name=affine1 type=NaturalGradientAffineComponent input-dim=207 output-dim=2048 bias-stddev=0
# In nnet3 framework, p in P-norm is always 2.
component name=nonlin1 type=PnormComponent input-dim=2048 output-dim=256
component name=renorm1 type=NormalizeComponent dim=256 target-rms=1.0
component name=final-affine type=NaturalGradientAffineComponent input-dim=256 output-dim=3360 param-stddev=0 bias-stddev=0
component name=final-fixed-scale type=FixedScaleComponent scales=exp/nnet3/tdnn/configs/presoftmax_prior_scale.vec
component name=final-log-softmax type=LogSoftmaxComponent dim=3360
# Now for the network structure
component-node name=lda component=lda input=Append(Offset(input, -4), Offset(input, -3), Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2), Offset(input, 3), Offset(input, 4))
component-node name=affine1 component=affine1 input=lda 
component-node name=nonlin1 component=nonlin1 input=affine1
component-node name=renorm1 component=renorm1 input=nonlin1
component-node name=final-affine component=final-affine input=renorm1
component-node name=final-fixed-scale component=final-fixed-scale input=final-affine
component-node name=final-log-softmax component=final-log-softmax input=final-fixed-scale
output-node name=output input=final-log-softmax
